NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_td.c
/*
 * This confidential and proprietary software may be used only as
 * authorised by a licensing agreement from ARM Limited
 * (C) COPYRIGHT 2006-2012 ARM Limited
 * ALL RIGHTS RESERVED
 * The entire notice above must be reproduced on all authorised
 * copies and copies may only be made to the extent permitted
 * by a licensing agreement from ARM Limited.
 */

#include "gles_m200_td.h"
#include "gles_fb_texture_object.h"

#include "shared/binary_shader/bs_symbol.h"
#include "base/mali_dependency_system.h"

#include "../gles_texture_object.h"

#include "base/mali_debug.h"
#include "util/mali_math.h"
#include "gles_fb_context.h"
#include "shared/mali_shared_mem_ref.h"
#include "shared/m200_gp_frame_builder_inlines.h"

#define FROM_ADDR( x ) ( x >> 6 )
/**
 * @brief Fills out a 'disabled' TD which will cause Mali200 to render black
 * @param dest The mali texture descriptor, in client memory, to fill out, a 512 bit block.
 * @param mali_td A pointer to the pre-allocated texture descriptor in mali memory. This pointer or
 *                its value will not be changed and is only necessary for a workaround for hardware
 *                issue 2363
 */
MALI_STATIC void _gles_m200_make_disabled_td( m200_td dest, u32 mali_address )
{
	MALI_IGNORE( mali_address );

	_gles_m200_td_set_defaults( dest );

#ifdef HARDWARE_ISSUE_2363
	/** setup dimensions - this is to get somewhat predictable addressing,
	*  M200_TEXEL_FORMAT_NO_TEXTURE is treated as 1bpp by mali200, but the
	*  result is never used.
	*/
	MALI_TD_SET_TEXTURE_DIMENSIONALITY( dest, M200_TEXTURE_DIMENSIONALITY_2D );
	MALI_TD_SET_TEXTURE_FORMAT( dest, M200_TEXTURE_FORMAT_NORMALIZED );
	MALI_TD_SET_TEXTURE_ADDRESSING_MODE( dest, M200_TEXTURE_ADDRESSING_MODE_LINEAR );

	MALI_TD_SET_TEXTURE_DIMENSION_S( dest, 1 );
	MALI_TD_SET_TEXTURE_DIMENSION_T( dest, 1 );
	MALI_TD_SET_TEXTURE_DIMENSION_R( dest, 1 );

	MALI_TD_SET_LAMBDA_LOW_CLAMP( dest, 0 );
	MALI_TD_SET_LAMBDA_HIGH_CLAMP( dest, 0 );
	MALI_TD_SET_MIPMAPPING_MODE( dest, M200_MIPMAP_MODE_NEAREST );

	/* Make sure M200 gets a valid address - the texture descriptor should be OK */
	mali_address = FROM_ADDR( mali_address );
	MALI_TD_SET_MIPMAP_ADDRESS_0( dest, mali_address );
#endif
}

#undef FROM_ADDR

mali_bool _gles_m200_is_texture_usable(gles_texture_object *tex_obj)
{
	MALI_DEBUG_ASSERT_POINTER(tex_obj);

	/* if there's no data in level 0 or the texture is incomplete, we should
	   disable the entire texture */
	if (
		(NULL == tex_obj->mipchains[0]) ||
		(NULL == tex_obj->mipchains[0]->levels[0]) ||
		( MALI_FALSE == _gles_texture_object_is_complete(tex_obj))
	)
	{
		return MALI_FALSE;
	}

	return MALI_TRUE;
}

/**
 * @brief updates one TD based on info from a tex_obj.
 * @param ctx the context
 * @param dst the TD where we place the result
 * @param tex_obj the object which contains our info
 * @param mali_td_memory_address
 * @param td_idx the texture plane this texture descriptor is associated with
 */
MALI_CHECK_RESULT mali_err_code _gles_m200_td_update(struct gles_context *ctx, m200_td *dst, gles_texture_object *tex_obj, u32 *mali_td_memory_address, u32 td_idx)
 {
	MALI_DEBUG_ASSERT_POINTER(ctx);
	MALI_DEBUG_ASSERT_POINTER(dst);
	MALI_DEBUG_ASSERT_POINTER(tex_obj);
	MALI_DEBUG_ASSERT_POINTER(tex_obj->internal);
	MALI_DEBUG_ASSERT_POINTER(mali_td_memory_address);
	MALI_DEBUG_ASSERT(tex_obj->dirty == MALI_FALSE, ("dirty check should be done by now"));
	MALI_DEBUG_ASSERT(tex_obj->is_complete, ("The texture object should be complete"));

#if EXTENSION_OES_EGL_IMAGE_EXTERNAL
	MALI_DEBUG_ASSERT_LEQ(td_idx, 2);
#else
	MALI_DEBUG_ASSERT_LEQ(td_idx, 0);
#endif

	/* remove old mali TD if present */
	if ( MALI_NO_HANDLE != tex_obj->internal->mali_tds[td_idx] )
	{
		_mali_mem_deref(tex_obj->internal->mali_tds[td_idx]);
		tex_obj->internal->mali_tds[td_idx] = MALI_NO_HANDLE;
	}

	/* create new TD */
	/* allocate persistent TD memory */
	tex_obj->internal->mali_tds[td_idx] = _mali_mem_alloc( ctx->base_ctx, sizeof(m200_td), M200_TD_ALIGNMENT, MALI_PP_READ ); /* comes with one reference, the texobj reference */
	if ( MALI_NO_HANDLE == tex_obj->internal->mali_tds[td_idx]) return MALI_ERR_OUT_OF_MEMORY;

	/* upload TD to mali memory */
	_mali_mem_write_cpu_to_mali(tex_obj->internal->mali_tds[td_idx], 0, *dst, sizeof(m200_td), sizeof(u32) );
	*mali_td_memory_address = _mali_mem_mali_addr_get( tex_obj->internal->mali_tds[td_idx], 0 );
	
	/* since the TD was invalidated, also invalidate the TD last used frame */
	tex_obj->internal->tds_last_used_frame = MALI_BAD_FRAME_ID;

	return MALI_ERR_NO_ERROR;
}

/**
 * @brief retrieves a complete texture object from a sampler, if present
 * @param state The current gles state
 * @param prog_binary_state the current bs program struct
 * @param sampler_id the id of the sampler we want to retrieve the object from
 * @return the texture object retrieved from the sampler, or NULL if it isn't a complete texture object. 
 */
gles_texture_object* _gles_get_texobj_from_sampler(gles_state *state, bs_program * prog_binary_state, int sampler_id)
{
	gles_texture_unit *texture_unit;
	gles_texture_object *texture_object;
	int texture_unit_id;

	MALI_DEBUG_ASSERT_RANGE((s32)sampler_id, 0, (s32)prog_binary_state->samplers.num_samplers-1);
	MALI_DEBUG_ASSERT_POINTER(state);
	MALI_DEBUG_ASSERT_POINTER(prog_binary_state);

	texture_unit_id = prog_binary_state->samplers.info[sampler_id].API_value;
		
	MALI_DEBUG_ASSERT_RANGE(texture_unit_id, 0, GLES_MAX_TEXTURE_UNITS-1);

	texture_unit = &state->common.texture_env.unit[texture_unit_id];
	MALI_DEBUG_ASSERT_POINTER(texture_unit);

	{
		enum gles_texture_target texture_target = GLES_TEXTURE_TARGET_INVALID;
		struct bs_symbol *symb = prog_binary_state->samplers.info[sampler_id].symbol;
		MALI_DEBUG_ASSERT_POINTER(symb);

		switch (symb->datatype)
		{
			case DATATYPE_SAMPLER:
				MALI_DEBUG_ASSERT(2 == symb->type.primary.vector_size, ("Not a 2D texture!"));
				texture_target = GLES_TEXTURE_TARGET_2D;
			break;

#if EXTENSION_OES_EGL_IMAGE_EXTERNAL
			case DATATYPE_SAMPLER_EXTERNAL:
				texture_target = GLES_TEXTURE_TARGET_EXTERNAL;
			break;
#endif

			case DATATYPE_SAMPLER_CUBE:
				texture_target = GLES_TEXTURE_TARGET_CUBE;
			break;

			/*	case DATATYPE_SAMPLER_SHADOW: */
			default:
				MALI_DEBUG_ASSERT(0, ("unknown texture type (type: %d, vector size: %d)",
					symb->datatype,
					symb->type.primary.vector_size)
				);
				return NULL;
		}

