NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_td.c
		/* GLES 1.1 special: if the texture unit target is disabled, don't set the TD. 
		 * For GLES 2.0, all targets are always enabled. */
		if(texture_unit->enable_vector[texture_target] == GL_FALSE) return NULL; 

		texture_object = texture_unit->current_texture_object[texture_target];
	}

	MALI_DEBUG_ASSERT_POINTER(texture_object);

	/* Only texture objects that are valid will actually be used */
	if( ! _gles_m200_is_texture_usable(texture_object) ) return NULL;

	return texture_object;
}

MALI_CHECK_RESULT mali_err_code _gles_texture_used_in_drawcall( mali_frame_builder* frame_builder, gles_texture_object *texture_object, int num_descriptors)
{
	u32 i;
	int descriptor_index;

	MALI_DEBUG_ASSERT_POINTER(frame_builder);
	MALI_DEBUG_ASSERT_POINTER(texture_object);
	MALI_DEBUG_ASSERT(texture_object->is_complete, ("texture object must be complete at this point"));
#if EXTENSION_OES_EGL_IMAGE_EXTERNAL
	MALI_DEBUG_ASSERT_RANGE(num_descriptors, 1, 3);
#else
	MALI_DEBUG_ASSERT(1 == num_descriptors, ("Trying to assign multiple texture planes while the image external extension is disabled"));
#endif
	for(descriptor_index = 0; descriptor_index < num_descriptors; descriptor_index++ )
	{
		for( i = 0; i < texture_object->complete_levels; i++)
		{
			mali_err_code err;
			mali_bool regenerate_td = MALI_FALSE;
			struct gles_fb_texture_memory* texmem = _gles_fb_texture_object_get_memblock(texture_object->internal, i, descriptor_index, NULL);

			MALI_DEBUG_ASSERT_POINTER(texmem);
			MALI_DEBUG_ASSERT(_gles_fb_texture_memory_valid(texmem), ("All memory must be valid at this point; a constraint resolve should have happened otherwise."));

			/* add texmem to drawcall */
			err = _gles_fb_texture_memory_draw(texmem, frame_builder, &regenerate_td);
			if(err != MALI_ERR_NO_ERROR) 
			{
				/* We failed to rebuffer something, meaning the texmem block is currently without memory. 
				 * This must be treated as a constraint resolve case the next time around it is used for drawing */
				texture_object->internal->need_constraint_resolve = MALI_TRUE;
				return err;
			}

			if(regenerate_td) _gles_m200_td_level_change(texture_object, i);

		} /* for all miplevels */
	} /* for all planes */ 
	return MALI_ERR_NO_ERROR;
}

/**
 * Allocates a set of disabled TDs and assign them to the given TD remap table at slot 0-num_descriptors. 
 * @param ctx The GLES context
 * @param td_remap The TD remap table to add TDs to. 
 * @param num_descriptors The number of descriptors to add 
 **/
MALI_CHECK_RESULT mali_err_code _gles_add_disabled_texobj_to_remap_table(struct gles_context *ctx, u32* td_remap, int num_descriptors)
{
	int descriptor_index;

	MALI_DEBUG_ASSERT_POINTER(ctx);
	MALI_DEBUG_ASSERT_POINTER(td_remap);

#if EXTENSION_OES_EGL_IMAGE_EXTERNAL
	MALI_DEBUG_ASSERT_RANGE(num_descriptors, 1, 3);
#else
	MALI_DEBUG_ASSERT_RANGE(num_descriptors, 1, 1);
#endif

	for ( descriptor_index = 0; descriptor_index < num_descriptors; descriptor_index++ )
	{
		m200_td td;
		void *mali_td = _mali_mem_pool_alloc(ctx->frame_pool, sizeof(m200_td), &td_remap[descriptor_index]);
		if (NULL == mali_td) return MALI_ERR_OUT_OF_MEMORY;
		_gles_m200_make_disabled_td( td, td_remap[descriptor_index] );
		_mali_sys_memcpy_cpu_to_mali_32(mali_td, td, sizeof(m200_td), sizeof(u32) );
	}

	/* debug asserts */
	for ( descriptor_index = 0; descriptor_index < num_descriptors; descriptor_index++ )
	{
		MALI_DEBUG_ASSERT(td_remap[descriptor_index] != 0, ("Must be a legal address"));
		MALI_DEBUG_ASSERT_ALIGNMENT(td_remap[descriptor_index], M200_TD_ALIGNMENT);
	}

	return MALI_ERR_NO_ERROR;
}

/**
 * Assigns a set of TDs and assign them to the given TD remap table at slot 0-num_descriptors. 
 * The TDs are taken from the input texture object. 
 * @param ctx The GLES context
 * @param frame_builder The framebuilder to add read dependencies on (used by renderable textures)
 * @param td_remap The TD remap table to add TDs to.
 * @param texture_object The texture object to get TDs from. 
 *        This function may update the mali_td field of the internal texture object as needed. 
 * @param num_descriptors The number of descriptors to add 
 **/
MALI_CHECK_RESULT mali_err_code _gles_add_texobj_to_remap_table(struct gles_context *ctx, mali_frame_builder* frame_builder, u32* td_remap, gles_texture_object *texture_object, int num_descriptors)
{
	int descriptor_index;
	mali_err_code err;
	mali_base_frame_id frameid;

	MALI_DEBUG_ASSERT_POINTER(ctx);
	MALI_DEBUG_ASSERT_POINTER(td_remap);
	MALI_DEBUG_ASSERT_POINTER(texture_object);
	MALI_DEBUG_ASSERT_POINTER(texture_object->internal);
	MALI_DEBUG_ASSERT(texture_object->is_complete, ("This function should only be called on complete texture objects"));

#if EXTENSION_OES_EGL_IMAGE_EXTERNAL
	MALI_DEBUG_ASSERT_RANGE(num_descriptors, 1, 3);
#else
	MALI_DEBUG_ASSERT_RANGE(num_descriptors, 1, 1);
#endif
	frameid = _mali_frame_builder_get_current_frame_id(frame_builder); 

	/* Add the internal texture object deref to the frame callback-list. 
	 * This will cause subsequent updates to trigger CoWs where needed until the HW job is done, and prevents the object from being deleted prematurely. */
	if(frameid != texture_object->internal->to_last_used_frame)
	{
		err = _mali_frame_builder_add_callback(frame_builder, (mali_frame_cb_func)_gles_fb_texture_object_deref, (mali_frame_cb_param)texture_object->internal);
		if (MALI_ERR_NO_ERROR != err)
		{
			MALI_DEBUG_ASSERT(err == MALI_ERR_OUT_OF_MEMORY, ("inconsistent error code returned (got 0x%X, expected 0x%X)", err, MALI_ERR_OUT_OF_MEMORY));
			return err;
		}
		_gles_fb_texture_object_addref(texture_object->internal);
		texture_object->internal->to_last_used_frame = frameid;
	}

	/* If the texture object has been modified since the last drawcall, 
	 * we may need to upload a new texture descriptor. This code block 
	 * deals with last minute constraint resolving, then uploads the new TD. 
	 */
	if( texture_object->dirty || texture_object->internal->need_constraint_resolve || texture_object->internal->using_renderable_miplevels )
	{
		int descriptor_index = 0;
		
		/* First do a normal constraint resolve. 
		 * This path is only taken if the user uploaded something unreasonable,
		 * but which passed completeness testing. */
		if( texture_object->internal->need_constraint_resolve )
		{
			err = _gles_texture_object_resolve_constraints(texture_object);
			if(MALI_ERR_NO_ERROR != err)
			{
				MALI_DEBUG_ASSERT(err == MALI_ERR_OUT_OF_MEMORY, ("unexpected error code"));
				return err;
			}
		}
	
		/* Next, flag the memory as being used by a drawcall. Normally this state is never cleared. 
		 * For renderable textures, this must be done every drawcall. For normal textures
		 * this is only done at the first drawcall, when we're creating the TD. */ 
		if( texture_object->internal->using_renderable_miplevels  || texture_object->dirty )
		{
			err = _gles_texture_used_in_drawcall( frame_builder, texture_object, num_descriptors);
			if (MALI_ERR_NO_ERROR != err) return err;
		}	

		/* After handling all constraint flags, recreate all the TDs and clear the dirtyflags*/ 
		texture_object->dirty = MALI_FALSE ;
		for(descriptor_index = 0; descriptor_index < num_descriptors; descriptor_index++)
		{
			err = _gles_m200_td_update( ctx, &texture_object->internal->tds[descriptor_index], texture_object, &td_remap[descriptor_index], descriptor_index);
			if(err != MALI_ERR_NO_ERROR)
			{
				texture_object->dirty = MALI_TRUE;
				return err;
			}
		}

