NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_td.c
	}

	/* The mali_TD copy of the TD is residing in Mali memory. Depending on the result from the previous code block, 
	 * it may or may not have been replaced. To ensure that all drawcalls retain the correct TD, the TD must be addref'ed individually. 
	 * Once addref'ed, the adress of the TDs can be written into the TD remap table. 
	 */
	for(descriptor_index = 0; descriptor_index < num_descriptors; descriptor_index++)
	{
		if( (texture_object->dirty || texture_object->internal->need_constraint_resolve || texture_object->internal->using_renderable_miplevels) 
		    || frameid != texture_object->internal->tds_last_used_frame)
		{
			MALI_DEBUG_ASSERT_POINTER(texture_object->internal->mali_tds[descriptor_index]);
			err = _mali_frame_builder_add_callback(frame_builder, (mali_frame_cb_func)_mali_mem_deref, (mali_frame_cb_param)texture_object->internal->mali_tds[descriptor_index]);
			if(err != MALI_ERR_NO_ERROR) return err;
			_mali_mem_addref(texture_object->internal->mali_tds[descriptor_index]);
		}
		td_remap[descriptor_index] = _mali_mem_mali_addr_get( texture_object->internal->mali_tds[descriptor_index], 0 );
	}
	if(frameid != texture_object->internal->tds_last_used_frame)
	{
		texture_object->internal->tds_last_used_frame = frameid;
	}

	/* debug asserts */
	for ( descriptor_index = 0; descriptor_index < num_descriptors; descriptor_index++ )
	{
		MALI_DEBUG_ASSERT(td_remap[descriptor_index] != 0, ("Must be a legal address"));
		MALI_DEBUG_ASSERT_ALIGNMENT(td_remap[descriptor_index], M200_TD_ALIGNMENT);
	}

	return MALI_ERR_NO_ERROR;
}

MALI_STATIC void _gles_m200_td_update_grad_table( gles_state *state, bs_program *prog_binary_state, int sampler_index, gles_texture_object *texture_object )
{
	gles_program_rendering_state* rs;
	s32 offset;
	int w = 1;
	int h = 1;

	MALI_DEBUG_ASSERT_POINTER( state );
	MALI_DEBUG_ASSERT_POINTER( prog_binary_state );

	rs = state->common.current_program_rendering_state;
	MALI_DEBUG_ASSERT_POINTER( rs );

	offset = prog_binary_state->samplers.info[sampler_index].grad_metadata_index;
	MALI_DEBUG_ASSERT_RANGE(offset, -1, (int)prog_binary_state->fragment_shader_uniforms.cellsize);

	if(offset == -1) return;

	if ( NULL != texture_object && NULL != texture_object->mipchains[0] && NULL != texture_object->mipchains[0]->levels[0] )
	{
		w = texture_object->mipchains[0]->levels[0]->width;
		h = texture_object->mipchains[0]->levels[0]->height;
	}

	prog_binary_state->fragment_shader_uniforms.array[offset+0] = w;
	rs->fp16_cached_fs_uniforms[offset+0] = _gles_fp32_to_fp16(w);

	prog_binary_state->fragment_shader_uniforms.array[offset+1] = h;
	rs->fp16_cached_fs_uniforms[offset+1] = _gles_fp32_to_fp16(h);
}

MALI_STATIC void _gles_set_single_fragment_uniform_yuv( struct gles_common_state* c_state,
                                                        struct gles_program_rendering_state* prs,
                                                        int loc, float val)
{
	bs_program *program_bs;

	MALI_DEBUG_ASSERT_POINTER( c_state );
	MALI_DEBUG_ASSERT_POINTER( prs );

	program_bs = &prs->binary;
	MALI_DEBUG_ASSERT_POINTER( program_bs );

	MALI_DEBUG_ASSERT_RANGE(loc, 0, (int)program_bs->fragment_shader_uniforms.cellsize - 1);
	if (program_bs->fragment_shader_uniforms.array[loc] != val)
	{
		program_bs->fragment_shader_uniforms.array[loc] = val;
		prs->fp16_cached_fs_uniforms[loc] = _gles_fp32_to_fp16(val);
		mali_statebit_set( c_state, MALI_STATE_FB_FRAGMENT_UNIFORM_UPDATE_PENDING );
	}
}


MALI_STATIC void _gles_m200_update_yuv_uniforms( gles_state *state, bs_program *prog_binary_state, int sampler_index, gles_texture_object *texture_object )
{
	MALI_DEBUG_ASSERT_POINTER( state );
	MALI_DEBUG_ASSERT_POINTER( prog_binary_state );

#if EXTENSION_OES_EGL_IMAGE_EXTERNAL
	if ( texture_object != NULL && GLES_TEXTURE_TARGET_EXTERNAL == texture_object->dimensionality )
	{
		struct gles_common_state* c_state = &state->common;
		gles_program_rendering_state* rs = state->common.current_program_rendering_state;
		s32 offset = prog_binary_state->samplers.info[sampler_index].YUV_metadata_index;

		/* The following variable are various components we need to calculate to set up the YUV uniforms */
		float Kb, Kr;
		float ay, by, ac, bc;
		float Ab = 0.0f;
		float Ac = 1.0f;
		float As = 1.0f;
		float f0, f1, f2, f3, f4;
		float e1 = 0.0f;
		float e2 = 0.0f;
		float e3 = 0.0f;
		float e4 = 0.0f;
		float dr, dg, db;
		float q1, q2, q3, q4;

		/**
		 * The sampler, will calculate the RGBA value as:
		 *
		 * R = y*abs(f0)		+ u*e1 + v*f2 + dr
		 * G = max(y*f0, 0.0)	+ u*f3 + v*f4 + dg
		 * B = max(y*f0, 0.0)	+ u*f1 + v*e3 + db
		 * A = 1.0
		 *
		 * Where y is red on the first texture descriptor,
		 * u is green on the second texture descriptor and
		 * v is blue on the third texture descriptor.
		 */

		if(offset == -1) return;

#if EXTENSION_VIDEO_CONTROLS_ARM_ENABLE
		Ab = texture_object->yuv_info.brightness;
		Ac = texture_object->yuv_info.contrast;
		As = texture_object->yuv_info.saturation;
#endif

		if ( GLES_COLORSPACE_BT_601 == texture_object->yuv_info.colorspace )
		{
			Kb = 0.114f;
			Kr = 0.299f;
		}
		else if ( GLES_COLORSPACE_BT_709 == texture_object->yuv_info.colorspace )
		{
			Kb = 0.0722f;
			Kr = 0.2126f;
 		}
		else
		{
			Kb = 0.114f;
			Kr = 0.299f;
			MALI_DEBUG_ASSERT( MALI_FALSE, ( "invalid colorspace %d", texture_object->yuv_info.colorspace ) );
		}

		if ( GLES_COLORRANGE_FULL == texture_object->yuv_info.colorrange )
		{
			ay =  1.0f;
			by =  0.0f;
			ac =  1.0f;
			bc = -0.5f;
		}
		else if ( GLES_COLORRANGE_REDUCED == texture_object->yuv_info.colorrange )
		{
			ay = 1.164383562f;   /*  255.f / (235.f - 16.f); */
			by = -0.062745098f;  /* -16.f / 255.f; */
			ac = 1.138392857f;   /*  255.f / (240.f - 16.f);*/
			bc = -0.501960784f;  /* -128.f / 255.f; */
		}
		else
		{
			ay =  1.0f;
			by =  0.0f;
			ac =  1.0f;
			bc = -0.5f;
			MALI_DEBUG_ASSERT( MALI_FALSE, ( "invalid colorrange %d", texture_object->yuv_info.colorrange ) );
		}

		if(MALI_FALSE == texture_object->yuv_info.is_rgb)
		{
			const float one_minus_Kb = 1.0f - Kb;
			const float one_minus_Kr = 1.0f - Kr;
			const float one_minus_Kb_minus_Kr = one_minus_Kb - Kr;
			const float Ac_As_ac = Ac * As * ac;
			float f0_by;
			const float bc_plus_one_minus_Ac_half_plus_Ab = bc + (1.0f - Ac) / 2.0f + Ab;

			q1 = one_minus_Kb + one_minus_Kb;
			q2 = one_minus_Kr + one_minus_Kr;
			q3 = -q1 * Kb / one_minus_Kb_minus_Kr;
			q4 = -q2 * Kr / one_minus_Kb_minus_Kr;

			f0 = Ac * ay;
			f1 = Ac_As_ac * q1;
			f2 = Ac_As_ac * q2;
			f3 = Ac_As_ac * q3;
			f4 = Ac_As_ac * q4;

			f0_by = f0 * by;

			dr = f0_by + f2 * bc_plus_one_minus_Ac_half_plus_Ab;
			dg = f0_by + (f3 + f4) * bc_plus_one_minus_Ac_half_plus_Ab;
			db = f0_by + f1 * bc_plus_one_minus_Ac_half_plus_Ab;
		}
		else
		{
			f0 = -1.0;
			f1 = f2 = f4 = 0.0f;
			f3 = 1.0f;
			e3 = 1.0f;
			dr = dg = db = 0.0f;
		}

		_gles_set_single_fragment_uniform_yuv(c_state, rs, 0 + offset, dr );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 1 + offset, dg );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 2 + offset, db );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 3 + offset, f0 );

		_gles_set_single_fragment_uniform_yuv(c_state, rs, 4 + offset, e1 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 5 + offset, f3 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 6 + offset, f1 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 7 + offset, e2 );

