NexellCorp/android_hal_pyrope/ogl_4330/src/opengles/m200_backend/gles_m200_td.c
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 8 + offset, f2 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 9 + offset, f4 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 10 + offset, e3 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 11 + offset, e4 );

		if(texture_object->yuv_info.is_rgb)
		{
			_gles_set_single_fragment_uniform_yuv(c_state, rs, 12 + offset, 0 );
		} else {
			_gles_set_single_fragment_uniform_yuv(c_state, rs, 12 + offset, 1 );
		}
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 13 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 14 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 15 + offset, 0 );

	} else 
#endif
	{
		struct gles_common_state* c_state = &state->common;
		gles_program_rendering_state* rs = state->common.current_program_rendering_state;
		s32 offset = prog_binary_state->samplers.info[sampler_index].YUV_metadata_index;
		if(offset == -1) return;

		_gles_set_single_fragment_uniform_yuv(c_state, rs, 0 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 1 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 2 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 3 + offset, -1 );

		_gles_set_single_fragment_uniform_yuv(c_state, rs, 4 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 5 + offset, 1 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 6 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 7 + offset, 0 );

		_gles_set_single_fragment_uniform_yuv(c_state, rs, 8 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 9 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 10 + offset, 1 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 11 + offset, 0 );

		_gles_set_single_fragment_uniform_yuv(c_state, rs, 12 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 13 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 14 + offset, 0 );
		_gles_set_single_fragment_uniform_yuv(c_state, rs, 15 + offset, 0 );

	}

}

mali_err_code _gles_m200_update_texture_descriptors( struct gles_context *ctx, gles_fb_context *fb_ctx, mali_frame_builder *frame_builder, gles_state *state, bs_program *prog_binary_state )
{
	u32* td_remap;
	int num_samplers;
	int td_remap_table_size;
	u32 td_remap_table_address;
	int i;

	MALI_DEBUG_ASSERT_POINTER( ctx );
	MALI_DEBUG_ASSERT_POINTER( fb_ctx );
	MALI_DEBUG_ASSERT_POINTER( frame_builder );
	MALI_DEBUG_ASSERT_POINTER( state );
	MALI_DEBUG_ASSERT_POINTER( prog_binary_state );

	num_samplers = prog_binary_state->samplers.num_samplers;

	/* If no samplers used, early out. We will not need any sampler array at all. */
	if( num_samplers == 0 )
	{
		fb_ctx->current_td_remap_table_address  = 0;
		return MALI_ERR_NO_ERROR;
	}

	/* Allocate the TD remap table */
 	td_remap_table_size = prog_binary_state->samplers.td_remap_table_size * sizeof( u32 * );

	td_remap = (u32*)_mali_mem_pool_alloc(ctx->frame_pool, td_remap_table_size, &td_remap_table_address);
	if (NULL == td_remap) return MALI_ERR_OUT_OF_MEMORY;
	_mali_sys_memset( td_remap, 0, td_remap_table_size );

	/**
	 * Map all samplers onto the slots of the td remap table and make them match their proper TD.
	 * Create/update TD's as required.
	 * Note that there is a 1:1 mapping between sampler ID and location in the TD remap table.
	 */
	for(i = 0; i < num_samplers; i++)
	{
		gles_texture_object *texture_object;
		mali_err_code err;
		int num_descriptors = 1;

		/* Get texture object and add it to table slot i.
		 * If the texobj is present and valid, it will be returned. 
		 * If the texobj is invalid or incomplete, this function will return NULL. */
		texture_object = _gles_get_texobj_from_sampler(state, prog_binary_state, i);

		if ( MALI_TRUE == prog_binary_state->samplers.info[i].YUV )
		{
			_gles_m200_update_yuv_uniforms(state, prog_binary_state, i, texture_object);
		}

		if( MALI_TRUE == prog_binary_state->samplers.info[i].is_grad )
		{
			_gles_m200_td_update_grad_table(state, prog_binary_state, i, texture_object);
		}

		if( NULL == texture_object ) 
		{
			err = _gles_add_disabled_texobj_to_remap_table(ctx, td_remap +
			                                              prog_binary_state->samplers.info[i].td_remap_table_index, 
														  num_descriptors);			 	
			if(err != MALI_ERR_NO_ERROR) return err;				
		} else {

			#if EXTENSION_OES_EGL_IMAGE_EXTERNAL
			if(texture_object->dimensionality == GLES_TEXTURE_TARGET_EXTERNAL && MALI_FALSE == texture_object->yuv_info.is_rgb) num_descriptors = 3;	
			#endif

			MALI_DEBUG_ASSERT_POINTER(texture_object);
			MALI_DEBUG_ASSERT(texture_object->is_complete, ("_gles_get_texobj_from_sampler should never return an incomplete texture"));

			err = _gles_add_texobj_to_remap_table(ctx, frame_builder, td_remap +
			                                      prog_binary_state->samplers.info[i].td_remap_table_index,
			                                      texture_object, num_descriptors);
			if(err != MALI_ERR_NO_ERROR) return err;
		} /* end if texobj == NULL */
	} /* end for all samplers */

	/* save remap table and deref old remap table */
	fb_ctx->current_td_remap_table_address  = td_remap_table_address;

	return MALI_ERR_NO_ERROR;
}

void _gles_m200_td_dimensions( gles_texture_object *tex_obj, u32 width, u32 height, u32 stride, u32 bpp, mali_bool is_linear, u32 plane)
{
#if EXTENSION_OES_EGL_IMAGE_EXTERNAL
	MALI_DEBUG_ASSERT_LEQ(plane, 2);
#else
	MALI_DEBUG_ASSERT_LEQ(plane, 0);
#endif

#if defined(USING_MALI400) || defined(USING_MALI450)
	MALI_TD_SET_TEXTURE_STRIDE( tex_obj->internal->tds[plane], stride );
	MALI_TD_SET_TEXTURE_DIMENSION_S( tex_obj->internal->tds[plane], width );
#endif
#if USING_MALI200
	/*
	 * Mali 200 does not support the stride in linear textures.
	 * Setting the stride as width, a black column will be sampled at right,
	 * but the texture will be used properly..
	 * Setting width as width, the texture will be sampled in a bad way and
	 * there will be no workaroud for it.
	 */
	MALI_TD_SET_TEXTURE_DIMENSION_S( tex_obj->internal->tds[plane], (MALI_TRUE==is_linear) ? stride/bpp : width );
#else
	MALI_IGNORE(bpp);
#endif
	MALI_TD_SET_TEXTURE_DIMENSION_T( tex_obj->internal->tds[plane], height );
	MALI_TD_SET_TEXTURE_DIMENSION_R( tex_obj->internal->tds[plane], 1 );

	MALI_TD_SET_TEXTURE_TOGGLE_STRIDE( tex_obj->internal->tds[plane], is_linear );

}

